{
  "data": [
    {
      "id": 1,
      "name": "Alicante",
      "image": "alicante.jpg",
      "desc": "Alicante is a city and port in Spain on the Costa Blanca, the capital of the province of Alicante. It is known for its beautiful beaches, vibrant nightlife, and rich history. The city boasts a mix of modern architecture and historic sites, including the Santa Bárbara Castle, which offers panoramic views of the city and the Mediterranean Sea. Alicante is also famous for its annual festivals, such as the Bonfires of Saint John, which features fireworks, music, and traditional celebrations. With its warm climate and diverse attractions, Alicante is a popular destination for tourists seeking sun, culture, and entertainment."
    },
    {
      "id": 2,
      "name": "Barcelona",
      "image": "barcelona.jpg",
      "desc": "Barcelona is a vibrant city located in the northeastern region of Spain, known for its rich culture, stunning architecture, and lively atmosphere. The city is famous for its unique blend of Gothic and modernist architecture, with iconic landmarks such as the Sagrada Família, Park Güell, and Casa Batlló designed by the renowned architect Antoni Gaudí. Barcelona is also a hub for art and culture, boasting numerous museums, galleries, and theaters. The city's bustling streets are filled with cafes, restaurants, and shops, offering a taste of Catalan cuisine and vibrant nightlife. With its beautiful beaches, historic sites, and dynamic cultural scene, Barcelona is a must-visit destination for travelers seeking a mix of history, art, and vibrant city life."
    },
    {
      "id": 3,
      "name": "Valencia",
      "image": "valencia.jpg",
      "desc": "Valencia is a vibrant city located on the eastern coast of Spain, known for its rich history, stunning architecture, and lively culture. The city boasts a mix of old and new, with historic landmarks such as the Valencia Cathedral and the Silk Exchange (La Lonja) standing alongside modern attractions like the City of Arts and Sciences. Valencia is also famous for its beautiful beaches, bustling markets, and delicious cuisine, particularly the traditional dish paella. The city's lively festivals, such as Las Fallas, feature elaborate sculptures, fireworks, and street parties that attract visitors from around the world. With its warm climate, diverse attractions, and vibrant atmosphere, Valencia is a popular destination for travelers seeking a blend of culture, history, and coastal charm."
    }
  ]
}
